Revit 2026 API

# SiteLocationConvertFromProjectTime Method

---

Converts project time to UTC time.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DateTime ConvertFromProjectTime(
	DateTime projectTime
)
```
```vb
Public Function ConvertFromProjectTime (
	projectTime As DateTime
) As DateTime
```
```cpp
public:
DateTime ConvertFromProjectTime(
	DateTime projectTime
)
```
```fsharp
member ConvertFromProjectTime :
        projectTime : DateTime -> DateTime
```

#### Parameters

projectTime DateTime
    The project time.

#### Return Value

DateTime

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when the projectTime's kind is not Unspecified. |

Daylight savings time is not considered during this conversion.

#### Reference

SiteLocation Class

Autodesk.Revit.DB Namespace